Tekla.Structures.Analysis.Remoting.Remoter
Remoter class

Tekla.Structures.Analysis.Remoting.Remoter.ChannelName
Name of the remoting channel to register.

Tekla.Structures.Analysis.Remoting.Remoter.isInitialized
The is initialized

Tekla.Structures.Analysis.Remoting.Remoter.PublishTypes
Publishes the types.

Tekla.Structures.Analysis.Remoting.Remoter.InitializeSandBox
Initializes the sand box.

Tekla.Structures.Analysis.Remoting.Remoter.CurrentDomainAssemblyResolve(System.Object,System.ResolveEventArgs)
Currents the domain assembly resolve.
sender: The sender.
args: The System.ResolveEventArgs instance containing the event data.
Returns: assembly